---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PropertySegmentSubcategoryId
source: html/43e279fa-9f3e-7759-aa06-4be1c49026d8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PropertySegmentSubcategoryId Property

"Subcategory"

## Syntax (C#)
```csharp
public static ForgeTypeId PropertySegmentSubcategoryId { get; }
```